<?php

namespace ErrorCode;

/**
 * 全局错误代码一览.
 *
 *
 * 约定
 * ========
 * - <=0是错误
 * - >0是正确
 *
 * 公用错误：    X 000--X 999
 * -------
 * - @throws '-     1' 访问空操作
 * - @throws '-   300' 没有对应的权限
 * - @throws '-   400' 未知错误（XYException中错误代码不是数字）
 * - @throws '-   401' 未被捕获的异常
 * - @throws '-   402' 未被捕获的致命问题
 * - @throws '-   404' 访问的操作/控制器不存在
 * - @throws '-   405' 版本号不存在
 * - @throws '- X 000' 数据库错误
 * - @throws '- X 997' 修改操作没有修改任何字段而导致
 * - @throws '- X 998' history字段溢出
 * - @throws '- X 999' 写"操作历史记录"失败
 *
 * 全部错误代码表，请看源代码：
 * ==========
 * - <a href="./source-class-ErrorCode.ErrorCode.html">点这里查看</a>
 *
 *
 * @api
 */
class ErrorCode
{
    function getErrorCodeMsg()
    {
        return $this->ERROR_MSG_CN;
    }


    protected $ERROR_MSG_CN = array(//因为不能用const才这么麻烦
        /**
         * 公用错误：    X 000--X 999
         */
        '-1' => '访问空操作',
        '-300' => '没有对应的权限',
        '-400' => '未知错误（XYException中错误代码不是数字）',
        '-401' => '未被捕获的异常',
        '-402' => '未被捕获的致命问题',
        '-403' => 'thinkphp抛出的异常',
        '-404' => '访问的操作/控制器不存在',
        '-405' => '版本号不存在',
        '-406' => '跨域非法访问',
        '-407' => '参数为空（整个post没传任何一个字段，然而服务器却要求有字段传入）',
        '-408' => 'Basecontroller中bc数学函数的默认小数点保留位数设置失败',


        //数据库错误
        '-1000' => '数据库错误',
        '-2000' => '数据库错误',
        '-3000' => '数据库错误',
        '-5000' => '数据库错误',
        '-6000' => '数据库错误',
        '-7000' => '数据库错误',
        '-8000' => '数据库错误',
        '-9000' => '数据库错误',
        '-10000' => '数据库错误',
        '-11000' => '数据库错误',
        '-12000' => '数据库错误',
        '-13000' => '数据库错误',
        '-14000' => '数据库错误',
        '-15000' => '数据库错误',
        '-16000' => '数据库错误',
        '-17000' => '数据库错误',
        '-18000' => '数据库错误',
        '-19000' => '数据库错误',
        '-20000' => '数据库错误',
        '-21000' => '数据库错误',
        '-23000' => '数据库错误',
        '-24000' => '数据库错误',
        '-25000' => '数据库错误',

        //单据类错误
        '-1997' => '修改操作没有修改任何字段而导致',
        '-1998' => 'history字段溢出',
        '-1999' => '写"操作历史记录"失败',

        '-2997' => '修改操作没有修改任何字段而导致',
        '-2998' => 'history字段溢出',
        '-2999' => '写"操作历史记录"失败',

        '-3997' => '修改操作没有修改任何字段而导致',
        '-3998' => 'history字段溢出',
        '-3999' => '写"操作历史记录"失败',


        /**
         * Order：        1 000--1 999
         */
        '-1001' => 'oid不合法',
        '-1002' => 'cid不合法',
        // '-1003' => 'bucunzai',
        '-1004' => 'mobile长度不合法',
        '-1005' => 'park_address长度不合法',
        '-1006' => 'car_license长度不合法',
        '-1007' => 'off不合法',
        '-1008' => 'cash不合法',
        '-1009' => 'bank金额不合法',
        '-1010' => 'remark长度不合法',
        '-1011' => 'status不合法',
        '-1012' => 'exceptionNo不合法',
        '-1013' => 'exception长度不合法',
        '-1014' => 'reopen不合法',
        // '-1014' => 'bucunzai',
        '-1015' => 'class不合法',
        '-1016' => 'operator_uid不合法',
        '-1017' => 'contact_name长度不合法',
        '-1018' => '在线支付金额不合法',
        '-1019' => 'value不合法',
        '-1020' => 'name长度不合法',

        //从-1021到-1032，内容和status状态码对应，如：
        '-1021' => '单据状态不能改为"已完成"',
        '-1022' => '单据状态不能改为"异常"',
        '-1023' => '单据状态不能改为"被删除单据"',
        '-1024' => '单据状态不能改为"立即处理"',
        '-1025' => '单据状态不能改为"暂不通知库管"',
        '-1026' => '单据状态不能改为"正在通知库管"',
        '-1027' => '单据状态不能改为"已通知库管，库管未确认"',
        '-1028' => '单据状态不能改为"库管已确认，但未出库"',
        '-1029' => '单据状态不能改为"已出库但未送达"',
        '-1030' => '单据状态不能改为"库管已确认，但未入库"',
        '-1031' => '单据状态不能改为"待审核-暂不通知库管"',
        '-1032' => '单据状态不能改为"待审核-立即处理"',


        '-1033' => '调账金额不合法',

        '-1034' => 'is_calculated不合法',
        '-1035' => 'freight不合法',
        '-1036' => 'freight_cal_method不合法',
        '-1037' => 'reopen或isDelete不合法',
        '-1038' => 'reg_time不合法',
        '-1039' => 'sto_id不合法',
        '-1040' => 'sto_name不合法',
        '-1041' => 'isdeliver不合法',
        '-1042' => 'freight_received不合法',
        '-1043' => '非草稿单不能改成草稿单',

        '-1050' => '购物车内数据不合法',
        '-1051' => '商品余量不足',

        '-1401' => '优惠金额不能大于货物价值',

        '-1501' => '删除草稿单据失败',
        '-1502' => '期初单据不能修改',
        '-1503' => '删除cid下的单据失败',

        '-1700' => '个推发送失败',
        '-1701' => '个推未知异常',


        /**
         * Warehouse：    2 000--2 999
         */
        '-2001' => 'wid不合法',
        '-2002' => 'class不合法',
        '-2003' => 'remark长度不合法',
        '-2004' => 'check_uid不合法',
        '-2005' => 'reg_time不合法',
        '-2006' => 'sto_id不合法',
        '-2007' => 'new_sto_id不合法',
        '-2050' => '购物车内数据不合法',
        '-2051' => 'sku_id的商品余量不足',

        '-2501' => '删除草稿单据失败',
        '-2502' => '没有填写盘点人',


        /**
         * Finance：    3 000--3 999
         */
        '-3001' => 'class不合法',
        '-3002' => 'cash不合法',
        '-3003' => 'bank不合法',
        '-3004' => 'remark长度不合法',
        '-3006' => 'income实收不合法（实收为负）',
        '-3007' => '更新单位余额失败',
        '-3008' => 'name长度不合法',
        '-3009' => 'fid不合法',
        '-3010' => '在线支付不合法',
        '-3011' => '某一个订单超过了最大可收/付款额度，msg里是这个订单的oid',
        '-3012' => 'reg_time不合法',
        '-3050' => '购物车不合法',
        '-3051' => '购物车中某一行不合法（确认sku_id一定是正确的数字后才能使用本错误代码）',
        '-3052' => '购物车里的money总和和实收不相等',
        '-3053' => '购物车里的某张单据已经被删除',

        '-3501' => '删除草稿单据失败',
        '-3502' => 'status不合法',
        '-3503' => 'update_time不合法',
        '-3601' => '审核未经通过不允许财务操作',
        '-3603' => '该条订单不存在',
        '-3604' => '财务模式不合法',
        '-3605' => '您无法改变单据到该状态',
        '-3606' => 'is_invoice(是否有单据)参数不合法',
        '-3607' => '不能同时操作同一张银行卡',
        '-3608' => '编辑单据不合法',
        '-3609' => '不允许作废该单据',


        /**
         * GOOD：        5 000--5 999
         * 本错误涵盖`Good`、`SpuModel`、`SkuModel`、`CatModel` 4个Model。
         * - SkuModel从-5001开始
         * - SpuModel从-5050开始
         * - CatModel从-5080开始
         */
        '-5001' => 'sku_id不合法',
        '-5002' => 'spu_id不合法',
        '-5003' => 'cat_id不合法',
        '-5004' => 'spec_name长度不合法',
        '-5005' => 'stock不合法',
        '-5006' => 'unit_price不合法',
        '-5007' => 'sku_index不合法',
        '-5008' => 'spu_id不合法',
        '-5009' => 'skuStoData数组信息内容不合法',
        '-5010' => 'cat的status不合法',
        '-5011' => 'spu的status不合法',
        '-5012' => 'Cat的type不合法',
        '-5013' => 'Sku的type不合法',
        '-5014' => 'Sku的规格名称重名',
        '-5015' => 'Spu的type不合法',
        '-5016' => 'Sku的规格不能为空',
        '-5017' => 'unit_price小数位数不能超过两位',
        '-5018' => 'sto_id不合法',
        '-5019' => 'sto_id重复',
        '-5020' => '同一个sku_id不能改不同的规格',
        '-5021' => '财务类别名重复',
        '-5022' => '类别名已存在',

        '-5050' => 'spu_id不合法',
        '-5051' => 'spu_name长度不合法',
        '-5052' => 'spu_index不合法',
        '-5053' => 'qcode长度不合法',
        '-5054' => 'cat_id不合法',
        '-5056' => 'spu_name重名',

        '-5080' => 'cat_id不合法',
        '-5081' => 'cat_name长度不合法',
        '-5082' => 'cat_index不合法',
        '-5083' => '类别下还有sku存在，不能进行删除操作',
        '-5084' => 'cat_name重名',

        '-5501' => 'sku_id不存在',
        // '-5502' => 'sku库存不为0不能被删除',
        '-5503' => 'spu下还有sku存在，不能进行删除操作',
        '-5504' => 'spu已经发生业务往来不能被删除',
        '-5505' => 'sku已经发生业务往来不能被删除',
        '-5506' => 'sku_class不合法',
        '-5507' => '该条SKU数据不是财务类别数据',
        '-5508' => '该个类别已经被删除',


        /**
         * Company：    6 000--6 999
         * 本错误涵盖`Company`、`Contact`、`Carlicense`、`Phonenum` 4个Model。
         */
        '-6001' => 'cid不合法',
        '-6002' => '单位名称不合法',
        '-6003' => 'qcode长度不合法',
        '-6004' => 'mobile长度不合法',
        '-6005' => '单位名称重名',
        '-6006' => 'address长度不合法',
        '-6007' => '联系人名称长度不合法',
        '-6008' => 'car_license长度不合法',
        '-6009' => 'remark长度不合法',
        '-6010' => 'init_payable不合法',
        '-6011' => 'contact_id不合法',
        '-6012' => 'income不能为0',
        '-6013' => 'status不合法',
        '-6015' => 'phonenum_id不合法',
        '-6016' => 'carlicense_id不合法',
        '-6017' => '联系人数量达到上限',
        '-6018' => '联系人的电话号数量达到上限',
        '-6019' => '联系人的车牌号数量达到上限',
        '-6020' => '已发生业务往来的往来单位无法删除',
        '-6021' => 'mobile全部为空格组成',
        '-6022' => 'car_license全部为空格组成',
        '-6023' => 'pwd不合法',
        '-6024' => 'cid_name不合法',


        '-6050' => '购物车不合法',
        '-6051' => '购物车内数据不合法',
        // '-6052' => '购物车phonenum创建失败',
        // '-6053' => '购物车car_license创建失败',
        '-6054' => '购物车内phonenum_id不合法',
        '-6055' => '购物车内contact_id不合法',
        '-6056' => '购物车内carlicense_id不合法',

        '-6501' => 'queryRemain()中的type参数不合法',
        '-6502' => 'queryRemain()中的oidList参数不合法',
        '-6503' => 'getCompanyName()中的cid不合法',
        '-6504' => 'queryList()中的type不合法',
        '-6505' => 'setBalanceInFinance()中的信息不合法',
        '-6506' => 'setBalanceInOrder()中的信息不合法',
        '-6507' => 'requestStatementOfAccount()中的信息不合法',


        /**
         * Parkaddress：7 000--7 999
         */
        '-7001' => 'parkaddress_id不合法',
        '-7002' => 'park_address长度不合法',
        '-7003' => '停车位置数量达到上限',
        '-7004' => '停车位置全部为空格组成',


        /**
         * User：        8 000--8 999
         * 本错误涵盖`Login`、`User` 2个Model。
         */
        '-8001' => '手机格式不正确',
        '-8002' => '手机长度不合法',
        '-8003' => '创建者手机号必须存在',
        '-8004' => '手机号已被注册',
        '-8005' => '手机号长度不合法',
        '-8006' => '公司名已被注册',
        '-8007' => '公司名长度不合法',
        '-8008' => '用户名长度不合法',
        '-8009' => '在用户名禁止注册列表中',
        '-8010' => '密码长度不合法',
        '-8011' => '邮箱格式不正确',
        '-8012' => '邮箱长度不合法',
        '-8013' => '真实姓名name不合法',
        '-8014' => 'uid不合法',
        '-8016' => '注册的员工数超过上限',
        '-8017' => '只能是创建者才能修改公司名称',
        '-8018' => 'shopName不能为11位纯数字',
        '-8019' => '在管理员创建后自动添加内容时出错',
        '-8020' => '个推GTClientID不合法',
        '-8021' => 'industry不合法',
        '-8022' => 'province不合法',
        '-8023' => 'city不合法',
        '-8024' => 'qq不合法',
        '-8025' => 'status不合法',
        '-8026' => 'rpg不合法',
        '-8027' => '手机号未注册',
        '-8028' => '填写的邀请码不合法',
        '-8030' => '随机生成验证码失败',
        '-8031' => '所在区域不合法',
        '-8032' => '该条记录已经存在',

        // '-8049' => 'bucunzai',
        '-8050' => '退出失败',
        '-8051' => 'JSON 内容错误',

        '-8400' => '在登录状态下注册管理员账户是不被允许的',

        //下面是登录时会遇到的错误：
        '-8401' => '参数错误',
        '-8402' => '密码错误',
        '-8403' => '创建者不存在或用户不存在或被禁用',

        '-8501' => 'getUserInfo_name失败',
        '-8502' => 'getUserInfo_shopName失败',
        '-8503' => 'getUserInfo_GTClientID失败',
        '-8504' => 'editUserInfo函数中不是用户自己&&不是管理员在修改用户信息',
        '-8505' => 'getAdminUid失败',
        '-8506' => 'getList的type参数非法',
        '-8507' => 'getList失败',
        '-8508' => '操作register的用户没有权限',
        '-8509' => 'getWarehouseUidGTClientID失败',
        '-8510' => 'getShopInfo失败',
        '-8511' => 'getUserInfo_sn失败',
        '-8512' => 'getUserInfo失败',
        '-8513' => 'getOptionArray失败',
        '-8514' => '通过mobile访问数据库失败',

        '-8800' => '暂不支持修改创建者的手机',
        '-8801' => '非管理员用户不支持修改状态',
        '-8802' => '管理员用户不支持修改自身状态',
        '-8803' => '非管理员用户不支持修改角色',
        '-8804' => '管理员用户不支持修改自身角色',
        '-8805' => '非管理员用户不支持修改用户名',
        '-8806' => '用户名已存在',
        '-8807' => '管理员不支持修改其他管理员的角色',
        '-8808' => '无权限修改该项',


        '-8888' => '当前时段登录被关闭',
        '-8889' => '未登录',
        '-8890' => '您的账号已在其他机子上登录',


        /**
         * Query:        9 000--9 999
         */
        '-9001' => 'page不合法',
        '-9002' => 'pline不合法',
        '-9003' => 'remainType不合法',
        '-9004' => 'reg_st_time不合法',
        '-9005' => 'reg_end_time不合法',
        '-9006' => 'oid不合法',
        '-9007' => 'wid不合法',
        '-9008' => 'fid不合法',
        '-9009' => 'operator_uid 不合法',
        '-9010' => 'cid不合法',
        '-9011' => 'type不合法',
        '-9012' => 'search不合法',
        '-9013' => '没有传任何时间',
        '-9014' => 'financeType 不合法',
        '-9015' => 'bigClass 不合法',
        '-9016' => 'sku_id不合法',
        '-9017' => 'isInitialOrderShow不合法',
        '-9018' => 'field不合法',

        '-9050' => 'filter不合法',
        '-9051' => 'filter中class设置不合法',
        '-9052' => 'filter中status设置不合法',

        '-9550' => '订单单据中有cart不合法',


        /**
         * Config、Feedback、Apply：        10 000--10 999
         */
        //10001 - 10200为Feedback的错误区间
        '-10001' => 'content不合法',

        //10201 - 10400 为Apply的错误区间
        '-10201' => '姓名不合法',
        '-10202' => '公司名不合法',
        '-10203' => '行业名不合法',
        '-10204' => '微信不合法',
        '-10205' => '电话不合法',
        '-10206' => '邮箱不合法',
        '-10210' => '没有填写任何联系方式',
        '-10211' => 'apply_id不正确',

        //10500 - 10800 为Config错误区间
        '-10501' => 'getShopSysConfig出错',
        '-10502' => 'getSnConfig出错',
        '-10503' => 'getNextSn出错',
        '-10504' => 'updateSnConfig出错',
        '-10505' => '解锁用户非法',
        '-10506' => '商店未上锁',
        '-10507' => '商店已上锁',
        '-10508' => 'ck_jump_warehouseConfirm不合法',
        '-10509' => 'ck_jump_warehouOut不合法',
        '-10510' => 'ck_jump_deliver不合法',
        '-10511' => 'rk_jump_warehouseConfirm不合法',
        '-10512' => 'rk_jump_deliver不合法',
        '-10513' => 'order_flow_mode不合法',
        '-10514' => 'audit_flow_mode不合法',
        '-10515' => 'setUserMember()没产生任何更新',
        '-10516' => 'is_show_foreground_printer_button不合法',


        /**
         * EverydaySummarySheet        11 000--11 999
         */
        '-11001' => 'everyday_summary_sheet_id不合法',
        '-11002' => 'reg_time长度不合法',
        '-11003' => 'reg_time类型不合法',
        '-11004' => '没有填reg_time',

        '-11550' => '订单单据中有cart不合法',

        '-11501' => 'createSummarySheet中序列化失败',
        '-11502' => 'get_中反序列化失败',


        /**
         * Util        12 000--12 999
         */
        '-12001' => 'type不合法',
        '-12002' => '手机格式不正确',
        '-12003' => '验证码不合法',
        '-12004' => 'uid不合法',


        '-12501' => 'sendSingleVerifyCode中短信发送失败',
        '-12502' => '短信验证码不存在',
        '-12503' => '短信验证码已过期',
        '-12504' => '短信验证码错误',
        '-12505' => '极验验证码错误',
        '-12506' => '邮件的收件人为空',
        '-12507' => 'ip地址中文信息得到出错',
        '-12508' => '注册出现问题，请重试',
        '-12509' => '手机号已被注册，如有问题请联系客服',
        '-12510' => 'sendStatementOfAccount中短信发送失败',
        '-12511' => '要发送的内容非法',

        '-12601' => '验证码不正确',


        /**
         * Auth        13 000--13 999
         */
        '-13001' => 'uid不合法',
        '-13002' => 'group_id不合法',
        '-13003' => 'AuthGroupModel的title不合法',
        '-13004' => 'AuthGroupModel的status不合法',
        '-13005' => 'AuthGroupModel的rules不合法',
        '-13006' => 'AuthRuleModel的name不合法',
        '-13007' => 'AuthRuleModel的title不合法',
        '-13008' => 'AuthRuleModel的status不合法',
        '-13009' => 'AuthRuleModel的condition不合法',


        /**
         * SkuBill    14 000--14 999
         */
        '-14001' => 'sku_bill_id不合法',
        '-14002' => 'sku_id不合法',
        '-14003' => 'spu_id不合法',
        '-14004' => 'bill_class不合法',
        '-14005' => 'bill_status不合法',
        '-14006' => 'reg_time不合法',
        '-14007' => 'oid不合法',
        '-14008' => 'wid不合法',
        '-14009' => 'oid、wid同时为空',
        '-14010' => 'page不合法',
        '-14011' => 'pline不合法',
        '-14012' => 'reg_st_time不合法',
        '-14013' => 'reg_end_time不合法',
        '-14014' => 'field字段不合法',
        '-14015' => 'sto_id不合法',

        '-14050' => 'filter不合法',
        '-14051' => 'filter中class设置不合法',
        '-14052' => 'filter中status设置不合法',

        '-14501' => 'isHasContacts的id错误',
        '-14502' => 'isHasContacts的type错误',
        '-14503' => 'queryOrderAndWarehouse 中的 class 错误',
        '-14550' => '订单单据中有cart不合法',


        /**
         * Paybill    15 000--15 999
         */
        '-15001' => 'paybill_id不合法',
        '-15002' => 'bill_class错误',
        '-15003' => 'bill_money错误',
        '-15004' => '签名错误',
        '-15005' => 'sn错误',
        '-15006' => 'self::sign错误',
        '-15007' => '数据非法',
        '-15008' => 'beecloud云端金额不对',
        '-15009' => 'beecloud云端支付未成功',
        '-15010' => 'class非法',
        '-15011' => 'member_count不合法',
        '-15012' => '[崩溃级错误]数据库内容非法',
        '-15013' => 'msg不合法',

        '-15501' => '该bill_sn已经处理过',
        '-15502' => '暂不支持该业务',
        '-15503' => '不能向体验账户付费',


        /**
         * UserAccount    16 000--16 999
         */
        '-16001' => 'user_account_id不合法',
        '-16002' => 'bill_class错误',
        '-16003' => 'bill_money错误',
        '-16004' => 'admin_uid错误',
        '-16005' => 'member_count错误',
        '-16006' => 'money错误',
        '-16007' => '该优惠已使用过',

        '-16501' => '[崩溃级错误]数据库内容被篡改',
        '-16502' => '[崩溃级错误]数据库没有该用户的account信息',
        '-16503' => '[崩溃级错误]支付时数据库错误',
        '-16504' => '暂不支持自助降级会员类型，请联系客服',
        '-16505' => '余额不足，请充值',


        /**
         * Sms    17 000--17 999
         */
        '-17002' => '签名不正确',
        '-17003' => '手机数组不合法',
        '-17004' => '手机数组超长',
        '-17005' => 'content为空',
        '-17006' => 'dateSt错误',
        '-17007' => 'dateEnd错误',
        '-17008' => 'content错误',
        '-17009' => 'money错误',
        '-17010' => '手机格式不正确',
        '-17011' => 'token错误',

        '-17050' => '购物车内数据不合法',


        /**
         * PaymentDetails    18 000--18 999
         */
        '-18002' => 'class错误',
        '-18003' => 'id错误',
        '-18004' => 'operator_uid错误',
        '-18005' => 'money错误',


        /**
         * PrintTemplate    19 000--19 999
         */
        '-19002' => 'class错误',
        '-19003' => 'font_size错误',
        '-19004' => 'content为空',

        '-19050' => 'optionArray json错误',

        '-19501' => '打印模板为空',
        '-19502' => 'admin_uid错误',


        /**
         * Other    20 000--20 999
         */
        '-20002' => '文件上传错误',
        '-20003' => '文件在地震中消失了',
        '-20004' => '该值不是字符串',
        '-20005' => '该订单类别不存在',
        '-20006' => '该订单状态不存在',


        /**
         * SkuCidPrice    21 000--21 999
         */
        '-21001' => 'sku_cid_price_id 不合法',
        '-21002' => 'sku_id 不合法',
        '-21003' => 'spu_id 不合法',
        '-21004' => 'cid 不合法',
        '-21005' => 'price1 不合法',
        '-21006' => 'quantity1 不合法',
        '-21007' => 'update_time 不合法',

        '-21501' => '没有这个sku-cid-price',

        /**
         * StatementOfAccount    22 000--22 999
         */
        '-22001' => 's_guid 或 s_pwd 不合法',

        /**
         * Storage      23 000--23 999
         */
        '-23001' => 'sto_id不合法',
        '-23002' => 'sto_name不合法',
        '-23003' => 'sto_index不合法',
        '-23004' => 'status不合法',
        '-23005' => 'type不合法',
        '-23006' => 'remark长度不合法',
        '-23501' => 'sto_id不存在',
        '-23502' => 'sto_id已删除,请勿重复操作',
        /**
         * account
         */
        '-24001' => 'account_creator不合法',
        '-24002' => 'account_number不合法',
        '-24003' => 'account_name不合法',
        '-24004' => 'account_prefix不合法',
        '-24005' => 'account_balance不合法',
        '-24006' => '速查码不合法',
        '-24007' => '账户备注不合法',
        '-24008' => 'account_source_type不合法',
        '-24009' => '开户行不合法',
        '-24010' => '账户来源已存在',
        '-24011' => '来源名不可为空或不合法',
        '-24012' => '省名不合法',
        '-24013' => '市名不合法',
        '-24014' => '账户ID不合法',
        '-24015' => '交易金额不合法',
        '-24016' => '传入的余额与实际余额不符',
        '-24017' => '操作记录插入失败',
        '-24018' => '操作记录重复插入',
        '-24019' => '操作类型不合法',
        '-24020' => '分页参数不合法',
        '-24021' => '不存在该有效账户或者该账户不在您名下，可能该账户已经被您删除',
        '-24022' => '审核失败',
        '-24023' => '现金账户无法删除',
        /**
         *Department
         */
        '-24101' => '部门名字不合法',
        '-24102' => '部门状态不合法',
        '-24103' => '该状态修改不合法',
        '-24104' => 'depart_id不合法',
        '-24105' => '部门备注不合法',
        '-24106' => '部门名重复',


        /**
         * SkuStorage   25 000 -- 25 999
         */
        '-25001' => 'sku_id不合法',
        '-25002' => 'sto_id不合法',
        '-25003' => 'admin_uid不合法',
        '-25004' => 'unit_price不合法',
        '-25005' => 'stock不合法',
        '-25006' => 'reg_time不合法',
        '-25007' => 'update_time不合法',
        '-25008' => 'sku_storage_id不合法',
        '-25009' => 'sku_sto_index不合法',
        '-25010' => 'status不合法',
        '-25501' => '没有这行数据',

        /**
         * QiniuStorage
         */
        '-30001' => '七牛上传失败',
        '-30002' => '文件上传到服务器失败',
        '-30003' => '图片格式不正确',
        '-30004' => '生成url失败(七牛)',


        '-40001' => 'rpg_mode不合法',
    );

}
